package com.sebar.test.array;

/**
 * lg
 *  数组定义
 */
public class ArrayDefinition {
    /**
     * 1. 数组是一种线性表数据结构，它有一组连续的内存空间，来存储一组具有相同数据类型的数据
     */
    /**
     * 2. 线性表，就是数据排成一条线一样的数据结构，每个线性表上的数据最多只有前后两个方向，
     *    数组，链表，队列，栈 都是线性表结构
     *    二叉树，堆，图 是非线性表结构，数据之间不是简单的前后关系
     */
    /**
     * 3.连续的内存空间和相同类型的数据，因此具有的特性：随机访问
     *                                             弊端：插入或删除数据，需要做大量的数据搬迁工作
     *                                                   数组本身定义的时候需要指定大小。不支持动态扩容，需重新构建数组并进行数据搬迁
     */
}
